ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/UsartPro.c
    case CMD_SND_ANA_FILTER :                              // Receive filter of AN-RSANA
        if (UnitID == AN_ZBANA) {
            GetANAFilter(ch, pointer+4) ;                     // receive package
        }
        break ;

    case CMD_REQ_ANA_FILTER :                              // Request filter of AN-RSANA
        if (UnitID == AN_ZBANA) {
            BuildANAFilter(ch, pointer+4) ;                     // receive package
        }
        break ;

    case CMD_REQ_ANA_DATA :                              // Request ANA data(4-20ma)
        if (UnitID == AN_ZBANA) {
            BuildMDataANA(ch, pointer+4) ;                     // receive
        }
        break ;

    default:
        if (command < MAX_ECMD) {                   // handle end commands
            retval = false ;
        }
        break;

    }
    return retval;
}

/*************************************************************************
*
* Build send packet header
*
*************************************************************************/
void Uart_BuildHeader(char ch) {

    UART[ch].RxFirst = 0;                                // Reset pointers
    UART[ch].RxLast  = 0;
    UART[ch].TxLast  = 0;

    UART[ch].pTxBuffer[0] = ANPRO10_SYN ;                        /* Sync */
    UART[ch].pTxBuffer[1] = ANPRO10_SYN ;                        /* Sync */
    UART[ch].pTxBuffer[2] = ANPRO10_SYN ;                        /* Sync */
    UART[ch].pTxBuffer[3] = ANPRO10_SOH ;                        /* Start of header */
    UART[ch].pTxBuffer[4] = UART[ch].pRxBuffer[2] ;      /* RXID */
    UART[ch].pTxBuffer[5] = UART[ch].pRxBuffer[3] ;      /* Rx address */
    UART[ch].pTxBuffer[6] = 0x10 + UnitID ;              /* Unit ID */
    UART[ch].pTxBuffer[7] = MyAddress();                 /* Tx address */
    UART[ch].pTxBuffer[8] = 0 ;                          /* packlen HB, don't know yet */
    UART[ch].pTxBuffer[9] = 0 ;                          /* packlen LB, don't know yet */
    UART[ch].pTxBuffer[10] = 0 ;                         /* Header checksum, don't know yet */
}

/*************************************************************************
*
* Build  packet tail
*
*************************************************************************/
void Uart_BuildTail(char ch) {

    Uart_BuildHeader(ch);                                    // fist build the header

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = ECMD_NMDWOACK & 0xff ;  // End command lb
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = ECMD_NMDWOACK >> 8 ;    // End command hb
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = 0x00 ;                  // End data

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = UART[ch].TxSeqCnt++ ;   // Sequence counter

    UART[ch].pTxBuffer[8] = UART[ch].TxFirst -2;                    // correct length because stx's
    UART[ch].pTxBuffer[9] = (UART[ch].TxFirst-2) >> 8 ;             // packet len high

    UART[ch].pTxBuffer[10] = CalcDSTxChecksum(ch, 10) ;         // Get header checksum

    UART[ch].pTxBuffer[UART[ch].TxFirst] = CalcDSTxChecksum(ch, UART[ch].TxFirst) ; // Get checksum
    UART[ch].TxFirst++ ;                                        // OBS!! must be inc here due to ANSI standard !!!!

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = ANPRO10_EOT ;            // End of transmission
    UART[ch].TxCount = UART[ch].TxFirst;                      //bytes to send
    UART[ch].TxLast = 0;                                     // reset cunter
    if (ch == 0) {                                           // Turn on TXE for channel
        OS_RetriggerTimer(&TimerUSART0);                     // and start timeout TX timer
        SetBit(PORTE, 0x04) ;                                // TXE0 on
        OS_RetriggerTimer(&TimerUSART0On);                   // and start timer for on before TX
    } else if (ch ==1) {
        OS_RetriggerTimer(&TimerUSART1);                     // and start timeout TX timer
        SetBit(PORTE, 0x08) ;                                // TXE1 on
        OS_RetriggerTimer(&TimerUSART1On);                   // and start timer for on before TX
    }
}

/*************************************************************************
*
* Build datablock for card status
*
*************************************************************************/
void BuildStatusData(char ch){

    short ntna ;
    UART[ch].RxSendReply = true ;                               // flag for answering

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_STATUS & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_STATUS >> 8;
    ntna = UART[ch].TxFirst ;                                    /* remember index */
    UART[ch].TxFirst += 2 ;                                      // two byte length
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = ch ;               // channel
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = DEVICE_IO + UnitID ;   // Product ID
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = MyAddress();           // unit adddress
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = PROG_VERSION ;       // software version */
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = COMP_VERSION;        // cpmpability version
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = STORE_VERSION;        // cpmpability version
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (RXSIZE_UART & 0xff);         // rx buffer size
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (( RXSIZE_UART >> 8) & 0xff); // rx buffer size
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (TXSIZE_UART & 0xff);         // tx buffer size
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = ((TXSIZE_UART >> 8) & 0xff);  // tx buffer size
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = RestartStatus ;                  // restart flag
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = PROGTYPE_APP ;                // Application program

    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2)  & 0xff ;      // length of data block lb
    UART[ch].pTxBuffer[ntna+1] = ((UART[ch].TxFirst - ntna - 2) >> 8 ) & 0xff ; // length of data block hb

    RestartStatus = 0 ;                                                       // set reset stat to 0 = read
}

/*************************************************************************
*
* Build EEPROM data package
*
*************************************************************************/
void BuildEEPROMData(char ch, short pointer) {

    short ntna ;
    char channel;
    UART[ch].RxSendReply = true ;                               // flag for answering

