ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/UsartPro.c
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (RestartStatus << 4) ;    // Add restart status
    for (i = 0; i<12; i++) {
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = TData.Ana.Status[i] ;
        *((float*)&UART[ch].pTxBuffer[UART[ch].TxFirst]) = *((float*)&TData.Ana.Result[i]) ;   // ADresult
        UART[ch].TxFirst += sizeof(float) ;
    }

    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2)  & 0xff ;      // length of data block lb
    UART[ch].pTxBuffer[ntna+1] = ((UART[ch].TxFirst - ntna - 2) >> 8 ) & 0xff ; // length of data block hb

}

/*************************************************************************
*
* Build datablock for Stack status
*
*************************************************************************/
void BuildStackStatus(char ch, short pointer) {

    short ntna, stack ;
    UART[ch].RxSendReply = true ;                               // flag for answering

    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_STACKSTATUS & 0xff;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = CMD_REP_STACKSTATUS >> 8;
    ntna = UART[ch].TxFirst ;                                    /* remember index */
    UART[ch].TxFirst += 2 ;                                      // two byte length

    stack = OS_GetStackSpace(&TCB_USART0);                            // USART 0
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (stack & 0xff) ;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = ((stack>>8) & 0xff) ;
    stack = OS_GetStackSpace(&TCB_USART1);                            // USART 1
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (stack & 0xff) ;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = ((stack>>8) & 0xff) ;
    stack = OS_GetStackSpace(&TCB_WATCHDOG);                            // watchdog
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = (stack & 0xff) ;
    UART[ch].pTxBuffer[UART[ch].TxFirst++] = ((stack>>8) & 0xff) ;
    switch (UnitID) {
    case AN_ZB485 :
        stack = OS_GetStackSpace(&TCB_RS485Ctl);                            // RS485 Control
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = (stack & 0xff) ;
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = ((stack>>8) & 0xff) ;
        stack = OS_GetStackSpace(&TCB_RS485Rec);                            // RS485 receive
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = (stack & 0xff) ;
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = ((stack>>8) & 0xff) ;
        break;
    case AN_ZBANA :
        stack = OS_GetStackSpace(&TCB_AD7715);                            // AD handling
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = (stack & 0xff) ;
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = ((stack>>8) & 0xff) ;
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = 0 ;
        UART[ch].pTxBuffer[UART[ch].TxFirst++] = 0 ;
        break;
    }

    UART[ch].pTxBuffer[ntna] = (UART[ch].TxFirst - ntna - 2)  & 0xff ;      // length of data block lb
    UART[ch].pTxBuffer[ntna+1] = ((UART[ch].TxFirst - ntna - 2) >> 8 ) & 0xff ; // length of data block hb

}

//////////////////////////////////////////////////////////////////////////////
// Receiving data to IO module here
/////////////////////////////////////////////////////////////////////////////

/*************************************************************************
*
* Receive Command to Reset the EEPROM
*
*************************************************************************/
void GetResetEEPROM(char ch, short pointer) {

    EEPROMReset();
}


/*************************************************************************
*
* Receive Command to go to the bootloader program
*
*************************************************************************/
void GetGotoBootloader(char ch, short pointer) {

//    void (*BootApp)(void) = (void(*)())0xF000;

    // 128 -> 1281
    /*
    while ( (EECR & 1<<EEWE) != 0 ) //chech if EEPROM is ready
        ;
    EEARL = (0x0fff & 0xff);
    EEARH = (0x0fff >> 8);
    EEDR = 0xff;
    EECR |= (1<<EEMWE);
    EECR |= (1<<EEWE);
    while (EECR & (1<<EEWE))
        ;
    */
    while ( (EECR & 1<<EEPE) != 0 ) //chech if EEPROM is ready
        ;
    EEARL = (0x0fff & 0xff);
    EEARH = (0x0fff >> 8);
    EEDR = 0xff;
    EECR |= (1<<EEMPE);
    EECR |= (1<<EEPE);
    while (EECR & (1<<EEPE))

    // 128 -> 1281
    // WDTCR = 0x18;               //Start watchdog to genetate restart
    // WDTCR = 0x08;               //Start watchdog to genetate restart
    WDTCSR = 0x18;               //Start watchdog to genetate restart
    WDTCSR = 0x08;               //Start watchdog to genetate restart
}

/*************************************************************************
*
* Receive EEPROM data
*
*************************************************************************/
void GetEEPROMData(char ch, short pointer) {

  char channel;
  int t0;

    channel = UART[ch].pRxBuffer[pointer] ;
    if ((channel >= 0x80) && (UnitID == 0x01)) { // AN-ZBANA
      *((float*)&TData.Ana.Offset[channel & 0x0f]) = *((float*)&UART[ch].pRxBuffer[pointer+1]) ;  //offset
      *((float*)&TData.Ana.Gain[channel & 0x0f]) = *((float*)&UART[ch].pRxBuffer[pointer+5]) ;  //gain
    }
    WriteEEPROMBuffer((channel * sizeof(float) * 2), sizeof(float), (char*)&UART[ch].pRxBuffer[pointer+1]);
    t0 = OS_GetTime();
    do {
      OS_Delay(1);
    }while ((OS_GetTime()-t0)< (sizeof(float)*9) && !EEPWriteOK);  //8.5 ms programming time
    WriteEEPROMBuffer( (channel * sizeof(float) * 2) + sizeof(float), sizeof(float), (char*)&UART[ch].pRxBuffer[pointer+5]);
    t0 = OS_GetTime();
    do {
      OS_Delay(1);
    }while ((OS_GetTime()-t0)< (sizeof(float)*9) && !EEPWriteOK);
}

/*************************************************************************
*
* Receive AN-ZB485 setup
*
*************************************************************************/
void GetRS4Setup(char ch, short pointer) {

    TData.RS4.PortUsed = UART[ch].pRxBuffer[pointer];           // Get the setup
    TData.RS4.SensorType[0] = UART[ch].pRxBuffer[pointer+1];       // Get the sensor type
    TData.RS4.SensorType[1] = UART[ch].pRxBuffer[pointer+2];       // Get the sensor type
    WriteEEPROMByte(EEPROM_PORTSETUP, TData.RS4.PortUsed);      // store in EEPROM
    WriteEEPROMByte(EEPROM_PORTSETUP+1, TData.RS4.SensorType[0]);
    WriteEEPROMByte(EEPROM_PORTSETUP+2, TData.RS4.SensorType[1]);
    SetRS4Port();                                               // Set power on ports
}

/*************************************************************************
*
* Rceive data fo AD card
*
*************************************************************************/
void GetADData(char ch, short pointer) {

   char i, pair;

   if (UART[ch].pRxBuffer[pointer] <=3) {
     pair = 0;
   } else {
     pair = 1;
   }
   if (!TData.RS4.ToTargetBuffer[pair][0]) {                                // buffer empty?
      TData.RS4.ToTargetBuffer[pair][0] = true;                            //  Availible data for AD card
      TData.RS4.ToTargetBuffer[pair][1] = UART[ch].pRxBuffer[pointer++];   //  Channel to AD card
      TData.RS4.ToTargetBuffer[pair][2] = UART[ch].pRxBuffer[pointer++];   // nob in datablock
      for (i = 3; i < TData.RS4.ToTargetBuffer[pair][2] + 3; i++) {
          TData.RS4.ToTargetBuffer[pair][i] = UART[ch].pRxBuffer[pointer++];  //Get the buffer
      }
   }
}

/*************************************************************************
*
* Receive AN-ZBANA setup
*
*************************************************************************/
void GetANASetup(char ch, short pointer) {

