ErikHurum/S2Prog/IO/ANZB_ATmega1281/Src/UsartPro.c
    TData.Ana.PortUsed = UART[ch].pRxBuffer[pointer] + (UART[ch].pRxBuffer[pointer+1] << 8);  //Get the setup
    WriteEEPROMByte(EEPROM_PORTSETUP,UART[ch].pRxBuffer[pointer]);   // store in EEPROM
    WriteEEPROMByte(EEPROM_PORTSETUP+1,UART[ch].pRxBuffer[pointer+1]);
    SetAnaPort();                           // set the port on or off
}

/*************************************************************************
*
* Receive AN-ZBANA filter
*
*************************************************************************/
void GetANAFilter(char ch, short pointer) {
    char port;

    for (port = 0; port <12; port++) {
        TData.Ana.Filter[port] = UART[ch].pRxBuffer[pointer++];  //Get the filter
    }
}

/*************************************************************************
*
*  Receive data on USARTs
*
*************************************************************************/
extern char MySimAddress;
void ReceivePacketUart(char ch) {

    switch (UART[ch].RxState) {                  // check status
    case SYNC :
        // all functionallity in inerrupt routine
        break ;
    case HEADER :
        if (UART[ch].RxLast >= 6) {             // receive header
            UART[ch].RxPacklen = (UART[ch].pRxBuffer[4] + (UART[ch].pRxBuffer[5] * 256)) ; // Find length of package
            if (CalcDSRxChecksum(ch, 6) && (UART[ch].pRxBuffer[0] == (DEVICE_IO + UnitID))) {
                // header checksum OK and to me
                if ((UART[ch].RxPacklen < ((short) RXSIZE_UART-UART[ch].RxLast)) &&    /* chk. header */
                    (UART[ch].RxPacklen >= MIN_PACK_LEN)) {
                    UART[ch].RxState = RECEIVE ;       // Header ok go to data receive state
                    UART[ch].RxCount = UART[ch].RxLast + 1 ;    // Set receive counter
                } else {
                    GoToSyncUART(ch) ;                        // go to sync modus for recive
                }
            } else {
                GoToSyncUART(ch) ;                            // go to sync modus for recive
            }
        }
        break ;
    case RECEIVE :
        if (++UART[ch].RxCount >= UART[ch].RxPacklen) {
            if ((UART[ch].pRxBuffer[UART[ch].RxPacklen -1]) == ANPRO10_EOT) {
                if (CalcDSRxChecksum(ch, UART[ch].RxPacklen-2)) {
                    if ((UART[ch].pRxBuffer[1] >= 2 && UART[ch].pRxBuffer[1] != 1  && UART[ch].pRxBuffer[1] != 7 && UART[ch].pRxBuffer[1] != 11 && UART[ch].pRxBuffer[1] != 12 /*MyAddress()*/ )||      // message to me? or
                        (UART[ch].pRxBuffer[1] == 0xff)) {            // broadcast
                        MySimAddress = UART[ch].pRxBuffer[1];
                        hostAddress = UART[ch].pRxBuffer[3];            // address to sender (host)
                        UART[ch].RxState = HANDLE ;                     // Package OK
                        if (ch == 0) {
                            OS_SignalEvent(1, &TCB_USART0);
                        } else if (ch == 1) {
                            OS_SignalEvent(1, &TCB_USART1);
                        }
                    } else {
                        GoToSyncUART(ch) ;                             // go to sync modus for recive
                    }
                } else {
                    GoToSyncUART(ch) ;                                // go to sync modus for recive
                }
            } else {
                GoToSyncUART(ch) ;                                    // go to sync modus for recive
            }
        }
        break ;
    case HANDLE :
        break;
    default :
        GoToSyncUART(ch) ;                                            // go to sync modus for recive
        break ;
    }                                                           // end switch
    if (++UART[ch].RxLast >= RXSIZE_UART) {                     // check pointer
        UART[ch].RxLast = 0;                                     // reset pointer
    }
}


/*************************************************************************
*
* Calculate tx checksum (header and package) using Dallas Semiconductor one-wire CRC
*
*************************************************************************/
char CalcDSTxChecksum(char ch, unsigned short len) {

    unsigned short  cnt ;
    unsigned char   csum ;

    csum = 0 ;
    for (cnt = 4 ; cnt < len ; cnt++) {
        csum = crc[csum ^ UART[ch].pTxBuffer[cnt]] ;
    }
    return csum ;
}

/*************************************************************************
*
* Calculate rx packet checksum (header and package) using Dallas Semiconductor one-wire CRC
*
*************************************************************************/
short CalcDSRxChecksum(char ch, unsigned short len) {

    unsigned short  cnt ;
    unsigned char   csum ;

    csum = 0 ;
    for (cnt=0 ; cnt < len ; cnt++) {
        csum = crc[csum ^ UART[ch].pRxBuffer[cnt]] ;
    }
    if (csum == UART[ch].pRxBuffer[len]) {
        return true ;
    } else {
        return false ;
    }
}

/*************************************************************************
*
* Goes to sync mode
*
*************************************************************************/
__monitor void GoToSyncUART(char ch) {

    if (ch < 2) {
        UART[ch].SyncCnt = 0 ;                        // ready for sync
        UART[ch].RxState = SYNC ;
        UART[ch].RxFirst = 0 ;
    }
}
